##############################################
########솔까 잘 몰랐다. 시간 복잡도를 어캐 줄여야할지.###########
######## 반복문을 사용하면 O(N)이라 linear하게 겁나 높아진다. ########
######## 그래서 재귀 함수를 사용하여 O(log N)으로 풀어야한다. ########
##############################################

import sys

k, p, n = map(int,input().split())

def f(x,y):
    if y ==1:
        return x
    elif y % 2 ==0:
        ans = f(x,y//2)
        return ans * ans %1000000007
    else:
        ans = f(x,y//2)
        return ans * ans * x % 1000000007

f = f(p,n*10)

print(k*f%1000000007)
